[
  {
    "id": 1,
    "code": "AL",
    "name": "Alabama",
    "colour": "CA0034",
    "electoralVotes": 9,
    "party2016": "Republican",
    "trump": 62.37,
    "clinton": 34.2,
    "other2016": 3.43,
    "party2012": "Republican",
    "obama": 38.4,
    "romney": 60.5,
    "other2012": 1.1,
    "blurb": "Alabama has voted Republican in all ten elections since 1980. Alabama is 26.2% black, compared to 12.2% for the US overall. Compared to the national average, fewer adults here have a bachelor’s degree."
  },
  {
    "id": 2,
    "code": "AK",
    "name": "Alaska",
    "colour": "A1005D",
    "electoralVotes": 3,
    "party2016": "Republican",
    "trump": 51.42,
    "clinton": 36.67,
    "other2016": 11.91,
    "party2012": "Republican",
    "obama": 40.8,
    "romney": 54.8,
    "other2012": 4.4,
    "blurb": "Alaska has voted Republican since 1968. Alaska is 13.7% Native American or Native Alaskan, compared to 0.7% for the US overall. More adults here have a high school diploma, compared to the national average."
  },
  {
    "id": 4,
    "code": "AZ",
    "name": "Arizona",
    "colour": 870077,
    "electoralVotes": 11,
    "party2016": "Republican",
    "trump": 49.5,
    "clinton": 45.39,
    "other2016": 5.11,
    "party2012": "Republican",
    "obama": 44.6,
    "romney": 53.7,
    "other2012": 1.7,
    "blurb": "Arizona has been reliably Republican since Bill Clinton’s re-election in 1996. Distaste for Trump’s policies in the Latino and Mormon communities have made the race close, but Trump ultimately took the state by almost 4 percentage points. Arizona is also the only state where a law to legalize recreational marijuana was proposed on election day, but not passed."
  },
  {
    "id": 5,
    "code": "AR",
    "name": "Arkansas",
    "colour": "C50039",
    "electoralVotes": 6,
    "party2016": "Republican",
    "trump": 60.59,
    "clinton": 33.65,
    "other2016": 5.76,
    "party2012": "Republican",
    "obama": 36.9,
    "romney": 60.6,
    "other2012": 2.5,
    "blurb": "Arkansas has voted Republican eight times since 1976. Arkansas is 73.9% white, compared to 62.8% for the US overall. More adults here have a high school degree, compared to the national average."
  },
  {
    "id": 6,
    "code": "CA",
    "name": "California",
    "colour": "2900D5",
    "electoralVotes": 55,
    "party2016": "Democratic",
    "trump": 33.22,
    "clinton": 61.47,
    "other2016": 5.31,
    "party2012": "Democratic",
    "obama": 60.2,
    "romney": 37.1,
    "other2012": 2.7,
    "blurb": "California has voted Democratic seven times since 1976. California has a median income of $26,932, close to the national average of about $27,000. The state is 39.2% white, compared to 62.8% for the US overall. Subplot: Americans are calling for the splitting of California’s electoral votes for the next election."
  },
  {
    "id": 8,
    "code": "CO",
    "name": "Colorado",
    "colour": "72008C",
    "electoralVotes": 9,
    "party2016": "Democratic",
    "trump": 43.99,
    "clinton": 47.57,
    "other2016": 8.44,
    "party2012": "Democratic",
    "obama": 51.5,
    "romney": 46.1,
    "other2012": 2.4,
    "blurb": "Clinton continued the success that Barack Obama had in this state in 2008 and 2012. Despite leaning Republican throughout American history, Colorado has voted Democratic for the last 3 elections, partly due to its growing population of independent and Hispanic voters."
  },
  {
    "id": 9,
    "code": "CT",
    "name": "Connecticut",
    "colour": "5300AB",
    "electoralVotes": 7,
    "party2016": "Democratic",
    "trump": 40.9,
    "clinton": 54.64,
    "other2016": 4.46,
    "party2012": "Democratic",
    "obama": 58.1,
    "romney": 40.7,
    "other2012": 1.2,
    "blurb": "Connecticut has voted Democratic five times since 2000. Connecticut is 69.8% white, compared to 62.8% for the US overall. The number of adults with a graduate degree exceeds the national average."
  },
  {
    "id": 10,
    "code": "DE",
    "name": "Delaware",
    "colour": "5800A6",
    "electoralVotes": 3,
    "party2016": "Democratic",
    "trump": 41.92,
    "clinton": 53.36,
    "other2016": 4.72,
    "party2012": "Democratic",
    "obama": 58.6,
    "romney": 40,
    "other2012": 1.4,
    "blurb": "Delaware has voted Democratic eight times since 1976. Delaware is 21.1% black, compared to 12.2% for the US overall. More adults here have a high school degree, compared to the national average."
  },
  {
    "id": 11,
    "code": "DC",
    "name": "District of Columbia",
    "colour": "0000FF",
    "electoralVotes": 3,
    "party2016": "Democratic",
    "trump": 4.04,
    "clinton": 90.9,
    "other2016": 5.06,
    "party2012": "Democratic",
    "obama": 90.9,
    "romney": 7.3,
    "other2012": 1.8,
    "blurb": "The District of Columbia is a federal district encompassing the American capital city of Washington, including the White House and the Capitol (among other places). Democrats have won DC every year since 2004, and have won at least 90% of the popular vote in 2 straight elections. The District of Columbia's population is 48.7% black, compared to 12.2% for the US overall. More adults here have a graduate degree, compared to the national average."
  },
  {
    "id": 12,
    "code": "FL",
    "name": "Florida",
    "colour": "82007C",
    "electoralVotes": 29,
    "party2016": "Republican",
    "trump": 49,
    "clinton": 47.73,
    "other2016": 3.27,
    "party2012": "Democratic",
    "obama": 50,
    "romney": 49.1,
    "other2012": 0.9,
    "blurb": "The biggest battleground state in the American election, with extreme variations in demographics depending on the county. Each win in Florida always comes down to 1 or 2 percentage points, most exaggerated when Republican president George W. Bush beat Democratic nominee Al Gore by 500 votes, winning the crucial 25 electoral votes en route to his victory in the 2000 election. Trump himself only won this state by less than 2 percentage points, pulling a surprising amount of votes from the Latino community. Every president since 1996 has won the state of Florida, including Trump in this year’s election."
  },
  {
    "id": 13,
    "code": "GA",
    "name": "Georgia",
    "colour": "8C0072",
    "electoralVotes": 16,
    "party2016": "Republican",
    "trump": 51.11,
    "clinton": 45.83,
    "other2016": 3.06,
    "party2012": "Republican",
    "obama": 45.5,
    "romney": 53.3,
    "other2012": 1.2,
    "blurb": "Georgia has voted Republican eight times since 1984. Georgia is 30.9% black, compared to the national average of 12.2%. Clinton, who had huge wins in counties around Atlanta, lost the state by nearly 6 percentage points."
  },
  {
    "id": 15,
    "code": "HI",
    "name": "Hawaii",
    "colour": "1F00DF",
    "electoralVotes": 4,
    "party2016": "Democratic",
    "trump": 30.02,
    "clinton": 62.33,
    "other2016": 7.65,
    "party2012": "Democratic",
    "obama": 70.5,
    "romney": 27.8,
    "other2012": 1.7,
    "blurb": "Hawaii has voted Democratic in every election except 1984 and 1972, when incumbent Republican presidents Ronald Reagan and Richard Nixon won in landslide elections. Hawaii is 39.1% Asian, compared to 5.5% for the US overall. More adults here have a high school diploma, compared to the national average."
  },
  {
    "id": 16,
    "code": "ID",
    "name": "Idaho",
    "colour": "D50029",
    "electoralVotes": 4,
    "party2016": "Republican",
    "trump": 59.27,
    "clinton": 27.5,
    "other2016": 13.23,
    "party2012": "Republican",
    "obama": 32.6,
    "romney": 64.5,
    "other2012": 2.9,
    "blurb": "Since 1968, Idaho has always voted Republican, a whopping thirteen times in thirteen elections. Idaho is 83.3% white, compared to 62.8% for the US overall. Fewer adults here have a graduate degree, compared to the national average."
  },
  {
    "id": 17,
    "code": "IL",
    "name": "Illinois",
    "colour": "4E00B0",
    "electoralVotes": 20,
    "party2016": "Democratic",
    "trump": 39.09,
    "clinton": 54.94,
    "other2016": 5.97,
    "party2012": "Democratic",
    "obama": 57.6,
    "romney": 40.7,
    "other2012": 1.7,
    "blurb": "Illinois has voted Democratic in every election since 1992. Illinois is 14.2% black, compared to 12.2% for the US overall. The state has a median income similar to the national average (about $27,000)."
  },
  {
    "id": 18,
    "code": "IN",
    "name": "Indiana",
    "colour": "B0004E",
    "electoralVotes": 11,
    "party2016": "Republican",
    "trump": 57,
    "clinton": 37.97,
    "other2016": 5.03,
    "party2012": "Republican",
    "obama": 43.9,
    "romney": 54.1,
    "other2012": 2,
    "blurb": "With the exception of 2008, Indiana has been a faithful Republican state for the last fifty years. Trump, with local governor Mike Pence as his running mate, was able to win by a landslide, taking the state by nearly 20 percentage points. Thumbs up to Vigo County, which has picked the winner in every presidential election since 1952."
  },
  {
    "id": 19,
    "code": "IA",
    "name": "Iowa",
    "colour": 960068,
    "electoralVotes": 6,
    "party2016": "Republican",
    "trump": 51.14,
    "clinton": 41.75,
    "other2016": 7.11,
    "party2012": "Democratic",
    "obama": 52,
    "romney": 46.2,
    "other2012": 1.8,
    "blurb": "Iowa has voted Democratic six times since 1988, yet Donald Trump won the state by more than 9 percentage points. Trump’s success can be attributed to the amount of conservative voters in Iowa, along with local pride in Republican governor Terry Branstad."
  },
  {
    "id": 20,
    "code": "KS",
    "name": "Kansas",
    "colour": "B60048",
    "electoralVotes": 6,
    "party2016": "Republican",
    "trump": 57.19,
    "clinton": 36.16,
    "other2016": 6.65,
    "party2012": "Republican",
    "obama": 38,
    "romney": 59.7,
    "other2012": 2.3,
    "blurb": "Kansas has voted Republican in every election since 1968. Kansas has a median income of $27,015, similar to the national average of about $27,000. The state is 77.4% white, compared to 62.8% for the US overall."
  },
  {
    "id": 21,
    "code": "KY",
    "name": "Kentucky",
    "colour": "D0002E",
    "electoralVotes": 8,
    "party2016": "Republican",
    "trump": 62.54,
    "clinton": 32.69,
    "other2016": 4.77,
    "party2012": "Republican",
    "obama": 37.8,
    "romney": 60.5,
    "other2012": 1.7,
    "blurb": "Kentucky has voted Republican eight times since 1980. Kentucky is 85.8% white, compared to 62.8% for the US overall. More adults here have a high school degree, compared to the national average."
  },
  {
    "id": 22,
    "code": "LA",
    "name": "Louisiana",
    "colour": "B60048",
    "electoralVotes": 8,
    "party2016": "Republican",
    "trump": 58.1,
    "clinton": 38.44,
    "other2016": 3.46,
    "party2012": "Republican",
    "obama": 40.6,
    "romney": 57.8,
    "other2012": 1.6,
    "blurb": "Louisiana has voted Republican five times since 2000. Louisiana is 31.9% black, compared to 12.2% for the US overall. More adults here have a high school degree, compared to the national average."
  },
  {
    "id": 23,
    "code": "ME",
    "name": "Maine",
    "colour": "72008C",
    "electoralVotes": 4,
    "party2016": "Democratic",
    "trump": 45.15,
    "clinton": 47.85,
    "other2016": 7,
    "party2012": "Democratic",
    "obama": 56.3,
    "romney": 41,
    "other2012": 2.7,
    "blurb": "Maine is one of two states, along with Nebraska, who do not use the “winner-take-all” method of distributing electoral votes. Instead, two votes are given to the winner of the popular vote, and one each is given to the winner of Maine’s two congressional districts. In this year’s election, Clinton won the 1st district (encompassing Portland and the southwest area of Maine). Despite voting Democratic for the past six elections, the 2nd district (including Waterville and the northern area of Maine) voted for Trump."
  },
  {
    "id": 24,
    "code": "MD",
    "name": "Maryland",
    "colour": "3400CA",
    "electoralVotes": 10,
    "party2016": "Democratic",
    "trump": 34.81,
    "clinton": 59.62,
    "other2016": 5.57,
    "party2012": "Democratic",
    "obama": 62,
    "romney": 35.9,
    "other2012": 2.1,
    "blurb": "Maryland has voted Democratic in every election since 1992. Maryland is 29.0% black, compared to 12.2% for the US overall. The state has the third highest median household income (about $73,500) and third highest income per capita (about $36,600) in America."
  },
  {
    "id": 25,
    "code": "MA",
    "name": "Massachusetts",
    "colour": "2E00D0",
    "electoralVotes": 11,
    "party2016": "Democratic",
    "trump": 33.52,
    "clinton": 60.8,
    "other2016": 5.68,
    "party2012": "Democratic",
    "obama": 60.7,
    "romney": 37.5,
    "other2012": 1.8,
    "blurb": "Massachusetts has voted Democratic nine times since 1976. In fact, since 1990, each Democratic candidate, including Clinton this year, has won every county in the state. Massachusetts is 75.0% white, compared to 62.8% for the US overall. More adults here have a graduate degree, compared to the national average."
  },
  {
    "id": 26,
    "code": "MI",
    "name": "Michigan",
    "colour": "7C0082",
    "electoralVotes": 16,
    "party2016": "Republican",
    "trump": 47.6,
    "clinton": 47.33,
    "other2016": 5.07,
    "party2012": "Democratic",
    "obama": 54.2,
    "romney": 44.7,
    "other2012": 1.1,
    "blurb": "Michigan and New Hampshire were the only two states to have not called a winner by the morning after the election. Michigan, part of the Midwestern region known as the “Rust Belt,” had voted Democratic in the past 6 elections. However, Trump’s enticing promises of rejuvenating the manufacturing industry have made it extremely close. Current counts show Trump in the lead by around 13 thousand votes, but the result has not yet been called."
  },
  {
    "id": 27,
    "code": "MN",
    "name": "Minnesota",
    "colour": 770087,
    "electoralVotes": 10,
    "party2016": "Democratic",
    "trump": 44.94,
    "clinton": 46.43,
    "other2016": 8.63,
    "party2012": "Democratic",
    "obama": 52.7,
    "romney": 45,
    "other2012": 2.3,
    "blurb": "Minnesota has voted Democratic in every election since 1976. However, the margins for the Democrats were relatively small in Minnesota this year. Clinton only managed to beat Trump by 1.5 percentage points, compared to 10.3 and 7.7 percentage point victories, in 2008 and 2012 respectively, by the Obama campaign. Minnesota is 82.1% white, compared to 62.8% for the US overall. More adults here have a high school diploma, compared to the national average."
  },
  {
    "id": 28,
    "code": "MS",
    "name": "Mississippi",
    "colour": "B0004E",
    "electoralVotes": 6,
    "party2016": "Republican",
    "trump": 58.3,
    "clinton": 39.76,
    "other2016": 1.94,
    "party2012": "Republican",
    "obama": 43.8,
    "romney": 55.3,
    "other2012": 0.9,
    "blurb": "Mississippi has voted Republican in every election since 1980. Mississippi is 37.2% black, compared to 12.2% for the US overall. More people here live below the poverty line than the national average and the median income (about $21,000) is the lowest of all the states in America."
  },
  {
    "id": 29,
    "code": "MO",
    "name": "Missouri",
    "colour": "B0004E",
    "electoralVotes": 10,
    "party2016": "Republican",
    "trump": 57.11,
    "clinton": 37.99,
    "other2016": 4.9,
    "party2012": "Republican",
    "obama": 44.4,
    "romney": 45.8,
    "other2012": 9.8,
    "blurb": "Missouri has voted Republican for the past five years. Despite coming close in 2008 (the Democrats only lost by 0.1 percentage points or 4,000 votes), neither Clinton nor Obama were able to build on this success. This year, Clinton lost by almost 20 percentage points in this state."
  },
  {
    "id": 30,
    "code": "MT",
    "name": "Montana",
    "colour": "B60048",
    "electoralVotes": 3,
    "party2016": "Republican",
    "trump": 56.51,
    "clinton": 35.97,
    "other2016": 7.52,
    "party2012": "Republican",
    "obama": 41.7,
    "romney": 55.4,
    "other2012": 2.9,
    "blurb": "Montana has voted Republican ten times since 1976, and in all five elections since 2000. Montana is 87.2% white, compared to 62.8% for the US overall. More adults here have a high school diploma, compared to the national average."
  },
  {
    "id": 31,
    "code": "NE",
    "name": "Nebraska",
    "colour": "C50039",
    "electoralVotes": 5,
    "party2016": "Republican",
    "trump": 60.33,
    "clinton": 33.96,
    "other2016": 5.71,
    "party2012": "Republican",
    "obama": 38,
    "romney": 59.8,
    "other2012": 2.2,
    "blurb": "Nebraska and Maine are the only two states to split their electoral votes. The state gives 2 electoral votes to the winner of the popular vote, then one to the winner of each congressional district. Despite having a history of splitting its votes (most recently in 2008, when Obama took the Lincoln district), the majority of every Nebraskan district voted for Trump, giving him all 5 electoral votes possible."
  },
  {
    "id": 32,
    "code": "NV",
    "name": "Nevada",
    "colour": "72008C",
    "electoralVotes": 6,
    "party2016": "Democratic",
    "trump": 45.53,
    "clinton": 47.89,
    "other2016": 6.58,
    "party2012": "Democratic",
    "obama": 52.4,
    "romney": 45.7,
    "other2012": 1.9,
    "blurb": "Nevada, like Florida and Ohio, has voted for the winner of every presidential election since 1996. However, unlike Florida and Ohio, Nevada had its streak snapped this year. Since 1980, Nevada voted Republican and Democrat five times each, establishing Nevada as an important swing state. Nevada, alongside California, Maine, and Massachusetts also legalized the use of recreational marijuana on election day."
  },
  {
    "id": 33,
    "code": "NH",
    "name": "New Hampshire",
    "colour": "7C0082",
    "electoralVotes": 4,
    "party2016": "Democratic",
    "trump": 47.25,
    "clinton": 47.62,
    "other2016": 5.13,
    "party2012": "Democratic",
    "obama": 52,
    "romney": 46.4,
    "other2012": 1.6,
    "blurb": "New Hampshire has finally called its result, with Clinton winning by 3,000 votes and 0.4 percentage points. It has the 5th highest median income (around $34,700). The state had voted Democratic in the past four elections, but a revolt among supporters of Bernie Sanders (who was extremely popular in New Hampshire) may have caused Clinton to struggle."
  },
  {
    "id": 34,
    "code": "NJ",
    "name": "New Jersey",
    "colour": "5800A6",
    "electoralVotes": 14,
    "party2016": "Democratic",
    "trump": 41.41,
    "clinton": 54.58,
    "other2016": 4.01,
    "party2012": "Democratic",
    "obama": 58.4,
    "romney": 40.6,
    "other2012": 1,
    "blurb": "New Jersey has voted Democratic in every election since 1992. New Jersey has a median income of $33,450, above the national average of about $27,000. The state is 57.8% white, compared to 62.8% for the US overall."
  },
  {
    "id": 35,
    "code": "NM",
    "name": "New Mexico",
    "colour": 680096,
    "electoralVotes": 5,
    "party2016": "Democratic",
    "trump": 40.02,
    "clinton": 48.27,
    "other2016": 11.71,
    "party2012": "Democratic",
    "obama": 53,
    "romney": 42.8,
    "other2012": 4.2,
    "blurb": "New Mexico has voted Democratic six times since 1992. New Mexico is 47.0% Hispanic or Latino, compared to 16.9% for the US overall. More people than average live below the federal poverty line here."
  },
  {
    "id": 36,
    "code": "NY",
    "name": "New York",
    "colour": "3E00C0",
    "electoralVotes": 29,
    "party2016": "Democratic",
    "trump": 37.12,
    "clinton": 58.33,
    "other2016": 4.55,
    "party2012": "Democratic",
    "obama": 63.3,
    "romney": 35.2,
    "other2012": 1.5,
    "blurb": "Each presidential candidate generally wins their own home state, but that was impossible this year, since both Hillary Clinton and Donald Trump had ties to New York State. Trump was born in Queens in 1946, while Clinton served as senator of New York from 2001 to 2009. This state has voted Democratic five times since 2000. New York is 57.3% white, compared to 62.8% for the US overall. More adults here have a graduate degree, compared to the national average."
  },
  {
    "id": 37,
    "code": "NC",
    "name": "North Carolina",
    "colour": 870077,
    "electoralVotes": 15,
    "party2016": "Republican",
    "trump": 49.9,
    "clinton": 46.13,
    "other2016": 3.97,
    "party2012": "Republican",
    "obama": 48.4,
    "romney": 50.4,
    "other2012": 1.2,
    "blurb": "North Carolina is the state that everyone has their eyes on. Both candidates faced challenges and controversies here. Republican support of Trump was thought to have cooled off in this state, but Republican turnout actually increased this year, relative to Mitt Romney’s campaign in 2012. For Clinton, there were multiple reports of a “balky” voting process in which some voters were told that they needed a registered voting ID, a law that was struck down by the federal appeals court a few days before November 8th."
  },
  {
    "id": 38,
    "code": "ND",
    "name": "North Dakota",
    "colour": "DF001F",
    "electoralVotes": 3,
    "party2016": "Republican",
    "trump": 62.95,
    "clinton": 27.24,
    "other2016": 9.81,
    "party2012": "Republican",
    "obama": 38.7,
    "romney": 58.3,
    "other2012": 3,
    "blurb": "North Dakota has voted Republican eleven times since 1976. The state is 87.7% white, compared to 62.8% for the US overall. More adults here have a high school diploma, compared to the national average."
  },
  {
    "id": 39,
    "code": "OH",
    "name": "Ohio",
    "colour": 960068,
    "electoralVotes": 18,
    "party2016": "Republican",
    "trump": 51.9,
    "clinton": 43.38,
    "other2016": 4.72,
    "party2012": "Democratic",
    "obama": 50.7,
    "romney": 47.7,
    "other2012": 1.6,
    "blurb": "Ohio is another important battleground state, although the battle wasn’t nearly as close as in previous years (Obama won by 4.6 and 3.0 percentage points, but Clinton lost by 8.5 percentage points this year). Ohio, like Florida, has complicated demographics, with a mix of manufacturing zones, big cities like Columbus and Cleveland, and a wealth of suburbs and farmland. The Republicans’ decision to hold their national convention in Cleveland may have swung the decision in their favour."
  },
  {
    "id": 40,
    "code": "OK",
    "name": "Oklahoma",
    "colour": "E4001A",
    "electoralVotes": 7,
    "party2016": "Republican",
    "trump": 65.33,
    "clinton": 28.93,
    "other2016": 5.74,
    "party2012": "Republican",
    "obama": 33.2,
    "romney": 66.8,
    "other2012": 0,
    "blurb": "Oklahoma has voted Republican five times since 2000. Oklahoma is 9.4% Hispanic or Latino, compared to 16.9% for the US overall. More adults here have a high school degree, compared to the national average. Fun fact: Al Gore, in 2000, was the last Democratic nominee to win a county in Oklahoma."
  },
  {
    "id": 41,
    "code": "OR",
    "name": "Oregon",
    "colour": "5D00A1",
    "electoralVotes": 7,
    "party2016": "Democratic",
    "trump": 39.31,
    "clinton": 50.01,
    "other2016": 10.68,
    "party2012": "Democratic",
    "obama": 54.2,
    "romney": 42.1,
    "other2012": 3.7,
    "blurb": "Oregon has voted Democratic five times since 2000. Oregon is 77.6% white, compared to 62.8% for the US overall. Fewer adults here have a high school degree, compared to the national average."
  },
  {
    "id": 42,
    "code": "PA",
    "name": "Pennsylvania",
    "colour": "82007C",
    "electoralVotes": 20,
    "party2016": "Republican",
    "trump": 48.84,
    "clinton": 47.6,
    "other2016": 3.56,
    "party2012": "Democratic",
    "obama": 52,
    "romney": 46.6,
    "other2012": 1.4,
    "blurb": "Prior to this year, Pennsylvania had voted Democratic in every election since 1992. Hillary Clinton, in the Democratic Primary, had won the state over Bernie Sanders by almost 13 percentage points. On top of that, the Democrats held their national convention in Philadelphia, the heart of Pennsylvania and Clinton was polling extremely well in the state. Some political experts pointed to a safe 20 electoral votes for Clinton. However, the suburban and rural voters overwhelmed the big cities and the state went red, something that hasn’t happened in decades. This state was perhaps the most devastating blow to Clinton’s chances, and a great example of Trump’s “silent supporters.”"
  },
  {
    "id": 44,
    "code": "RI",
    "name": "Rhode Island",
    "colour": "5300AB",
    "electoralVotes": 4,
    "party2016": "Democratic",
    "trump": 39.54,
    "clinton": 53.76,
    "other2016": 6.7,
    "party2012": "Democratic",
    "obama": 62.7,
    "romney": 35.2,
    "other2012": 2.1,
    "blurb": "Rhode Island has voted Democratic ten times since 1976. Rhode Island has a median income of $27,742, similar to the national average of about $27,000. The state is 75.1% white, compared to 62.8% for the US overall. Trump actually won a county in Rhode Island. The last time a Rhode Island county voted Republican was in 1984, when Ronald Reagan swept 49 states across America."
  },
  {
    "id": 45,
    "code": "SC",
    "name": "South Carolina",
    "colour": "A60058",
    "electoralVotes": 9,
    "party2016": "Republican",
    "trump": 54.91,
    "clinton": 40.7,
    "other2016": 4.39,
    "party2012": "Republican",
    "obama": 44.1,
    "romney": 54.6,
    "other2012": 1.3,
    "blurb": "South Carolina has voted Republican ten times since 1976. South Carolina is 27.4% black, compared to 12.2% for the US overall. The state has a median income below the national average (about $27,000)."
  },
  {
    "id": 46,
    "code": "SD",
    "name": "South Dakota",
    "colour": "D0002E",
    "electoralVotes": 3,
    "party2016": "Republican",
    "trump": 61.53,
    "clinton": 31.74,
    "other2016": 6.73,
    "party2012": "Republican",
    "obama": 39.9,
    "romney": 57.9,
    "other2012": 2.2,
    "blurb": "South Dakota has voted Republican five times since 2000. South Dakota has a median income of $26,431, similar to the national average of about $27,000. The state is 83.6% white, compared to 62.8% for the US overall."
  },
  {
    "id": 47,
    "code": "TN",
    "name": "Tennessee",
    "colour": "C50039",
    "electoralVotes": 11,
    "party2016": "Republican",
    "trump": 61.34,
    "clinton": 35.06,
    "other2016": 3.6,
    "party2012": "Republican",
    "obama": 39.1,
    "romney": 59.5,
    "other2012": 1.4,
    "blurb": "Tennessee has voted Republican five times since 2000. Tennessee is 75.0% white, compared to 62.8% for the US overall. More adults here have a high school degree, compared to the national average."
  },
  {
    "id": 48,
    "code": "TX",
    "name": "Texas",
    "colour": 960068,
    "electoralVotes": 38,
    "party2016": "Republican",
    "trump": 52.44,
    "clinton": 43.32,
    "other2016": 4.24,
    "party2012": "Republican",
    "obama": 41.4,
    "romney": 57.2,
    "other2012": 1.4,
    "blurb": "Texas has voted Republican in every election for 30 years. The last time the state went blue was during Republican president Richard Nixon’s time in 1976, when his administration was accused of bugging their political opponents’ buildings and ordering the FBI and CIA to investigate activists and political groups, a scandal known as “Watergate.” Even a large Hispanic voter population couldn’t pull Clinton an upset in this state, as Trump ended up taking Texas with a convincing 9.2 percentage point win. In other news, Ted Cruz, another Republican nominee, retained his seat as the senator of Texas."
  },
  {
    "id": 49,
    "code": "UT",
    "name": "Utah",
    "colour": "B0004E",
    "electoralVotes": 6,
    "party2016": "Republican",
    "trump": 46.36,
    "clinton": 27.71,
    "other2016": 25.93,
    "party2012": "Republican",
    "obama": 24.7,
    "romney": 72.8,
    "other2012": 2.5,
    "blurb": "Utah was the state that both Clinton and Trump were afraid of coming in, but not of each other - Evan McMullin, a third-party candidate, threatened to take Utah away and force the election into a tie, which would send the candidates to the House of Representatives. McMullin actually garnered the most percentage points in any state by a third party candidate with 20.7% of the votes in Utah. However, he was still 6.8 percentage points behind Clinton and 25.4 points behind Trump."
  },
  {
    "id": 50,
    "code": "VT",
    "name": "Vermont",
    "colour": "2E00D0",
    "electoralVotes": 3,
    "party2016": "Democratic",
    "trump": 30.1,
    "clinton": 56.36,
    "other2016": 13.54,
    "party2012": "Democratic",
    "obama": 66.6,
    "romney": 31,
    "other2012": 2.4,
    "blurb": "Vermont has voted Democratic four times since 2000. Vermont has a median income of $27,079, similar to the national average of about $27,000. The state is 93.9% white, compared to 62.8% for the US overall. Political experts were questioning whether the email scandals leaked at the DNC, regarding her “rigging” of the primary election, would affect her performance in the state, as Vermont was the home state of Democratic nominee Bernie Sanders. Apparently not, as Clinton easily won the state by 28.5 percentage points. Meanwhile, Sanders retained his seat as the senator of Vermont."
  },
  {
    "id": 51,
    "code": "VA",
    "name": "Virginia",
    "colour": "72008C",
    "electoralVotes": 13,
    "party2016": "Democratic",
    "trump": 44.56,
    "clinton": 49.61,
    "other2016": 5.83,
    "party2012": "Democratic",
    "obama": 51.2,
    "romney": 47.3,
    "other2012": 1.5,
    "blurb": "Virginia was seen as a safe bet for Clinton. There was consistent strong polling here for Clinton and running mate Tim Kaine, a Virginia senator and former governor. The state is also home to the country’s richest, frequent Washington D.C commuters, and various Americans with advanced degrees. Although Trump closed the gap to around 4.9 percentage points, it wasn’t enough as Clinton came out with a win."
  },
  {
    "id": 53,
    "code": "WA",
    "name": "Washington",
    "colour": "4E00B0",
    "electoralVotes": 12,
    "party2016": "Democratic",
    "trump": 38.27,
    "clinton": 54.94,
    "other2016": 6.79,
    "party2012": "Democratic",
    "obama": 56.2,
    "romney": 41.3,
    "other2012": 2.5,
    "blurb": "Washington has voted Democratic eight times since 1976. Washington is 3.5% black, compared to 12.2% for the US overall. Fewer adults here have a high school degree, compared to the national average."
  },
  {
    "id": 54,
    "code": "WV",
    "name": "West Virginia",
    "colour": "F4000A",
    "electoralVotes": 5,
    "party2016": "Republican",
    "trump": 67.86,
    "clinton": 26.16,
    "other2016": 5.98,
    "party2012": "Republican",
    "obama": 35.5,
    "romney": 62.3,
    "other2012": 2.2,
    "blurb": "West Virginia has voted Republican five times since 2000. West Virginia is 92.7% white, compared to 62.8% for the US overall. More adults here have a high school degree, compared to the national average. Trump improved on Romney’s 2012 numbers, pulling around 70,000 more voters and winning every county."
  },
  {
    "id": 55,
    "code": "WI",
    "name": "Wisconsin",
    "colour": "7C0082",
    "electoralVotes": 10,
    "party2016": "Republican",
    "trump": 47.26,
    "clinton": 46.45,
    "other2016": 6.29,
    "party2012": "Democratic",
    "obama": 52.8,
    "romney": 45.9,
    "other2012": 1.3,
    "blurb": "Despite being reliably Democratic since the Ronald Reagan reelection in 1984, Wisconsin fell to Trump, completing his sweep of the midwest states. Clinton’s struggles can be traced to poor voter turnout, and the lack of support in Wisconsin in general (she actually lost the state primary to Bernie Sanders). Furthermore, Wisconsin’s demographics (87% white, 27% educated) played to Trump’s strengths, and was ultimately a crucial factor in his win."
  },
  {
    "id": 56,
    "code": "WY",
    "name": "Wyoming",
    "colour": "FF0000",
    "electoralVotes": 3,
    "party2016": "Republican",
    "trump": 68.17,
    "clinton": 21.88,
    "other2016": 9.95,
    "party2012": "Republican",
    "obama": 27.8,
    "romney": 68.6,
    "other2012": 3.6,
    "blurb": "Wyoming has voted Republican four times since 2000. Wyoming is 84.8% white, compared to 62.8% for the US overall. More adults here have a high school diploma, compared to the national average. Trump won by a huge margin here in this election, pulling in around 70.1% of the vote, around 47% more than Clinton. Even so, Trump was unable to win Teton county on the northwest side of the state, which has voted Democratic since 2004."
  },
  {
    "id": 60,
    "code": "AS",
    "name": "America Samoa",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 64,
    "code": "FM",
    "name": "Federated States of Micronesia",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 66,
    "code": "GU",
    "name": "Guam",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 68,
    "code": "MH",
    "name": "Marshall Islands",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 69,
    "code": "MP",
    "name": "Northern Mariana Islands",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 70,
    "code": "PW",
    "name": "Palau",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 72,
    "code": "PR",
    "name": "Puerto Rico",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 74,
    "code": "UM",
    "name": "U.S. Minor Outlying Islands",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  },
  {
    "id": 78,
    "code": "VI",
    "name": "Virgin Islands of the United States",
    "colour": "",
    "electoralVotes": "",
    "party2016": "",
    "trump": "",
    "clinton": "",
    "other2016": "",
    "party2012": "",
    "obama": "",
    "romney": "",
    "other2012": "",
    "blurb": ""
  }
]